; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	infrared0 - mode
	image1 - mode
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	Star1 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Planet17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet6)
	(supports instrument1 image1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star1)
	(supports instrument2 infrared0)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 infrared0)
	(supports instrument3 image1)
	(calibration_target instrument3 Star1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon15)
	(supports instrument4 infrared0)
	(supports instrument4 image1)
	(calibration_target instrument4 Star1)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star16)
	(supports instrument5 image1)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star1)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet8)
)
(:goal (and
	(pointing satellite0 Planet9)
	(have_image Phenomenon5 image1)
	(have_image Planet6 image1)
	(have_image Planet7 infrared0)
	(have_image Planet8 infrared0)
	(have_image Planet9 image1)
	(have_image Star10 infrared0)
	(have_image Phenomenon11 infrared0)
	(have_image Planet12 infrared0)
	(have_image Phenomenon13 image1)
	(have_image Star14 infrared0)
	(have_image Phenomenon15 infrared0)
	(have_image Star16 image1)
	(have_image Planet17 image1)
	(have_image Planet18 image1)
))

)

; plan
1. (turn_to satellite0 groundstation3 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 15
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 15
3. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 0 of 15
4. (turn_to satellite0 planet17 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet17)
   goals met: 0 of 15
5. (take_image satellite0 planet17 instrument0 image1)
   added: (have_image planet17 image1)
   goals met: 1 of 15
6. (turn_to satellite0 planet12 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 planet12)
   goals met: 1 of 15
7. (take_image satellite0 planet12 instrument0 infrared0)
   added: (have_image planet12 infrared0)
   goals met: 2 of 15
8. (turn_to satellite0 phenomenon5 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon5)
   goals met: 2 of 15
9. (take_image satellite0 phenomenon5 instrument0 image1)
   added: (have_image phenomenon5 image1)
   goals met: 3 of 15
10. (turn_to satellite0 phenomenon15 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon15)
   goals met: 3 of 15
11. (take_image satellite0 phenomenon15 instrument0 infrared0)
   added: (have_image phenomenon15 infrared0)
   goals met: 4 of 15
12. (turn_to satellite0 phenomenon13 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon13)
   goals met: 4 of 15
13. (take_image satellite0 phenomenon13 instrument0 image1)
   added: (have_image phenomenon13 image1)
   goals met: 5 of 15
14. (turn_to satellite0 phenomenon11 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon11)
   goals met: 5 of 15
15. (take_image satellite0 phenomenon11 instrument0 infrared0)
   added: (have_image phenomenon11 infrared0)
   goals met: 6 of 15
16. (turn_to satellite0 planet18 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet18)
   goals met: 6 of 15
17. (take_image satellite0 planet18 instrument0 image1)
   added: (have_image planet18 image1)
   goals met: 7 of 15
18. (turn_to satellite0 planet6 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 planet6)
   goals met: 7 of 15
19. (take_image satellite0 planet6 instrument0 image1)
   added: (have_image planet6 image1)
   goals met: 8 of 15
20. (turn_to satellite0 planet7 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet7)
   goals met: 8 of 15
21. (take_image satellite0 planet7 instrument0 infrared0)
   added: (have_image planet7 infrared0)
   goals met: 9 of 15
22. (turn_to satellite0 planet8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet8)
   goals met: 9 of 15
23. (take_image satellite0 planet8 instrument0 infrared0)
   added: (have_image planet8 infrared0)
   goals met: 10 of 15
24. (turn_to satellite0 star10 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star10)
   goals met: 10 of 15
25. (take_image satellite0 star10 instrument0 infrared0)
   added: (have_image star10 infrared0)
   goals met: 11 of 15
26. (turn_to satellite0 star14 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star14)
   goals met: 11 of 15
27. (take_image satellite0 star14 instrument0 infrared0)
   added: (have_image star14 infrared0)
   goals met: 12 of 15
28. (turn_to satellite0 star16 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star16)
   goals met: 12 of 15
29. (take_image satellite0 star16 instrument0 image1)
   added: (have_image star16 image1)
   goals met: 13 of 15
30. (turn_to satellite0 planet9 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 planet9)
   goals met: 14 of 15
31. (take_image satellite0 planet9 instrument0 image1)
   added: (have_image planet9 image1)
   goals met: 15 of 15
